








// --створити масив з:
//     - з 5 числових значень
// let x =[5, 6, 7, 8, 8, 5];
// console.log(x);
// - з 5 стічкових значень
// let x =['5', '6', '7', '8', '8', '5'];
// console.log(x);
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
// let x =[5, '6', 7, '8', 8>5 , 'jukkkh'];
// console.log(x);
//
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let x =[];
// x[0]= 3;
// x[2] = 'fgggg';
// console.log(x);
//
//
//
// - є масив [2,17,13,6,22,31,45,66,100,-18] :
// 1. перебрати його циклом while
// let x = [2,17,13,6,22,31,45,66,100,-18];
// let i = 0;
// while ( i < 2 ) {
//     console.log(x);
//     i++;}
// }
//     2. перебрати його циклом for
// for (let i = 0; i < 3; i++)
// console.log(x);
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let i = 0;
// while ( i < x.length ) {
//     if ((i % 2) !== 0)
//         console.log(x[i]);
//     i++;}
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// for (let i = 0; i < x.length; i++) {
//     if ((i % 2) !== 0)
//     console.log(x[i]);
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// let i = 0;
// while ( i < x.length ) {
//     if ((x[i] % 2) == 0)
//         console.log(x[i]);
//     i++;}
// let i = x.length - 1;
// while ( i >= 0 ) {
//     if ((x[i] % 2) == 0)
//         console.log(x[i]);
//     i--;}
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// for (let i = 0; i < x.length; i++) {
//     if ((x[i] % 2) == 0)
//     console.log(x[i])
// }
// 7. замінити кожне число кратне 3 на слово "okten"
// for (let i = 0; i < x.length; i++) {
//     if ((x[i] % 3) == 0)
//         (x[i] = 'okten')
//         console.log(x[i])
// 8. вивести масив в зворотньому порядку.
// for (let i = x.length - 1; i >= 0; i--) {
//     console.log(x[i]);
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// let x = [2,17,13,6,22,31,45,66,100,-18];
// for (let i = 0; i < x.length; i++) {
//     console.log(x[i])
// }
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// let x = [2,'dgg',13,'6','22','31',45,'66',100,-18];
// for (let i = 0; i < x.length; i++) {
//     console.log(x[i])
// }
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// let x = [2,'dgg',13,'6','22','31',45>6,'66',100,-18];
// for (let i = 0; i < x.length; i++) {
//     if( typeof x[i] === "boolean")
//     console.log(x[i])
// }
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// let x = [2,'dgg',13,'6','22','31',45>6,'66',100,-18];
// for (let i = 0; i < x.length; i++) {
//     if( typeof x[i] === "string")
//         console.log(x[i])
// };
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів.
// Вивести в консоль всі його елементи в циклі.
// let x = [];
// x[0] = 'fglgkf';
// x[1] = 'fgddflgkf';
// x[2] = 6;
// x[3] = 8>5;
// x[4] = 'fglhhgkf';
// x[5] = 'fglgkhf';
// x[6] = 3;
// x[7] = 'fdglgkf';
// x[8] = 8<11;
// x[9] = 'fgldddgkf';
// for (let i = 0; i < x.length; i++) {
//     console.log(x[i])
//
// }
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// let x =[];
// document.write(`<ul>`)
//
// for (let i = 0; i < 100; i++) {
//     document.write(`<li> gamma${i} </li>`);
// console.log([i])
// }
// document.write(`</ul>`)
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 100; i+=2) {
//     document.write(`<li> gamma${i} </li>`);
// console.log([i])
// }
// document.write(`</ul>`)
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// document.write(`<ul>`)
//
// for (let i = 0; i < 100; i++) {
//     if((i % 2) !== 0 )  (console.log([i]))
//     document.write(`<li> gamma${i} </li>`);
// }
// document.write(`</ul>`)
//
//
//
// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
// -знайти наібльшу книжку.
let books =[
    {name: 'woomens', page: 345, genre: 'detective',  authors:['fffff','ffdssss'] },
    {name: 'fdfddfd', page: 45, genre:['roman','bgbgbg'], authors:['fffff', 'ffdssss', 'fffdd']},
    {name: 'fdfddfd', page: 665, genre:'man', authors:['ff', 'ffdssss', 'fffdd', 'fffffkkl']}
];
for (let i = 0; i < books.length; i++) {
    const book = books[i];
    console.log(Math.max(book.page));
}

// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор
